Revit 2024 API
WorksharingSaveAsOptions.ClearTransmitted Property
 For a transmitted model opened with DetachAndPreserveWorksets, clear its transmitted flag in the Save/SaveAs operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool ClearTransmitted { get; set; }
Visual Basic
Public Property ClearTransmitted As Boolean
	Get
	Set
Visual C++
public:
property bool ClearTransmitted {
	bool get ();
	void set (bool value);
}
See Also
WorksharingSaveAsOptions Class
Autodesk.Revit.DB Namespace